app/controllers/layouts_controller.rb

  def index
    @layouts = Layout.paginate(:all, :page => params[:page], :per_page => 10)
---
SELECT * FROM `layouts` LIMIT 0, 10