app/controllers/paths_controller.rb

  def index
    @paths = Path.all
---
SELECT * FROM `paths`

  def new
    @path = Path.new
    @layouts = Layout.find :all, :order => 'name'
---
SELECT * FROM `layouts` ORDER BY name