app/controllers/styles_controller.rb

SELECT * FROM `styles`
---
  def index
    @styles = Style.all