app/controllers/users_controller.rb

SELECT * FROM `users` LIMIT 0, 10
---
  def index
    @users = User.paginate(:all, :page => params[:page], :per_page => 10)

INSERT INTO `users` (`username`, `password`, `created_at`, `updated_at`) VALUES('compose', 'compose', '2010-08-15 00:05:03', '2010-08-15 00:05:03')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save